//3.5 ბანკომატი
//ბანკომატის აპლიკაცია საშუალებას აძლევს მომხმარებელს განახორციელოს ბანკომატის  
//ძირითადი ოპერაციების სიმულაცია. მომხმარებელს შეუძლია შეასრულოს ისეთი ქმედებები,
//როგორიცაა: – რეგისტრაცია,  – დალოგინება,  – ბალანსის შემოწმება,  – თანხის შეტანა და  – თანხის გატანა,  – მომხმარებლის მონაცემები ინახება ტექსტურ ფაილში მომხმარებლის ანგარიშის 
//ინფორმაციის შესანარჩუნებლად. 
//სტუდენტს შეუძლია უფრო გაართულოს ფუნქციონალი შემდეგი პირობის შესრულებბის 
//გზით:  
//– სესხის მოთხოვნა და – მოთხოვნის დადასტურება ადმინის მხრიდან (იგულისხება, რომ ამ შემთხვევაში 
//რეგისტრაციის დროს მომხმარებელს აქვს 2 როლი: client, admin),


using System;
using System.Collections.Generic;
using System.Text;
using C__Project.Models.Enum;

namespace C__Project.Models
{
    public class UserForATM
    {
        public string Name { get; set; }
        public  string Lastname { get; set; }
        public Guid Id { get; set; }

        //public UserRoleATM  MyProperty { get; set; }

    }
}
